#+TITLE: Better Novelupdates RSS
#+AUTHOR: aerits
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

:links:
# https://www.pluralsight.com/guides/web-scraping-with-request-python
# https://orgmode.org/worg/org-contrib/babel/intro.html#literate-programming
# https://realpython.com/python-web-scraping-practical-introduction/
# https://www.wouterspekkink.org/academia/writing/tool/doom-emacs/2021/02/27/writing-academic-papers-with-org-mode.html
:end:

**** Get Requests
BNR needs =requests=. =requests= is needed to send =GET= requests to [[https://www.novelupdates.com]].

specifically novelupdates.com/readinglist_update.php?rid=<chapter id>&sid=<series id>&checked=yes

we get the chapter id from the rss feed, and the series id from a later section

#+NAME: import-requests
  #+BEGIN_SRC python
  import requests
#+END_SRC

This is dummy code utilizing a =http GET= request using =requests=.
#+BEGIN_SRC python :noweb yes :exports both
  <<imports>>
  url = 'https://jsonplaceholder.typicode.com/todos/1'
  response = requests.get(url)        # To execute get request
  print(response.status_code)     # To print http response code  
  print(response.text)            # To print formatted JSON response


  return str(response.status_code) + "\n" + response.text
#+END_SRC

#+RESULTS: imports
: 200
: {
:   "userId": 1,
:   "id": 1,
:   "title": "delectus aut autem",
:   "completed": false
: }

This is dummy code utilizing a =http POST= request using =requests=.
#+BEGIN_SRC python :exports both :noweb yes
  <<imports>>
  data = {'title':'Python Requests','body':'Requests are awesome','userId':1} 
  response = requests.post('https://jsonplaceholder.typicode.com/posts', data) 
  print(response.status_code) 
  print(response.text)
  return str(response.status_code) + "\n" + response.text
#+END_SRC

#+RESULTS:
: 201
: {
:   "title": "Python Requests",
:   "body": "Requests are awesome",
:   "userId": "1",
:   "id": 101
: }

***** THIS IS THE ACTUAL SECTION

# I AM SMART; USE THE FOLLOWING SHELL COMMAND TO GET NOVELUPDATES HTML this is very cool code

This is a script that downloads the html of a web page

#+NAME: page-downloader
#+BEGIN_SRC shell :tangle ./src/scripts/downloadPage.sh
  download_page () {
      w3m -dump_source $1 -o accept_encoding='*;q=0'
  }
#+END_SRC

#+RESULTS: page-downloader

the first if is for getting the series id. its in bash because idk how to do this in python lol

the second if is for getting the latest chapter

#+BEGIN_SRC shell :noweb yes :tangle ./src/scripts/downloadPage.sh
  <<page-downloader>>
  if [ $2 -eq 0 ]
  then
      download_page $1 | grep shortlink | cut -d"=" -f4
  elif [ $2 -eq 1 ]
  then
       download_page $1 | grep chp-release | head -n 2 | tail -n 1 | cut -d"/" -f5
  else
      echo "ENTER VALID COMMAND"
  fi
#+END_SRC

#+BEGIN_SRC shell :noweb yes
  sh ./src/scripts/downloadPage.sh https://www.novelupdates.com/series/isekai-tensei-soudouki/?pg=1#myTable 0
#+END_SRC

#+RESULTS:
: 8365' />

